{"keras_version": "1.2.1", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 40, 160, 3], "sparse": false, "input_dtype": "float32"}, "inbound_nodes": []}, {"name": "convolution2d_1", "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 1, "W_regularizer": null, "activation": "relu", "bias": true, "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_1", "nb_row": 1, "nb_filter": 3, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same"}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "convolution2d_2", "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "W_regularizer": null, "activation": "relu", "bias": true, "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_2", "nb_row": 3, "nb_filter": 32, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same"}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "convolution2d_3", "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "W_regularizer": null, "activation": "relu", "bias": true, "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_3", "nb_row": 3, "nb_filter": 32, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "maxpooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "convolution2d_4", "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "W_regularizer": null, "activation": "relu", "bias": true, "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_4", "nb_row": 3, "nb_filter": 64, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same"}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "convolution2d_5", "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "W_regularizer": null, "activation": "relu", "bias": true, "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_5", "nb_row": 3, "nb_filter": 64, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"name": "maxpooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"name": "convolution2d_6", "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "W_regularizer": null, "activation": "relu", "bias": true, "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_6", "nb_row": 3, "nb_filter": 64, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same"}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "convolution2d_7", "class_name": "Convolution2D", "config": {"b_constraint": null, "nb_col": 3, "W_regularizer": null, "activation": "relu", "bias": true, "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_7", "nb_row": 3, "nb_filter": 64, "dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "border_mode": "same"}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"name": "maxpooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "inbound_nodes": [[["maxpooling2d_4", 0, 0]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "flatten_2", "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "flatten_3", "class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}, "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "dot_axes": -1, "mode_type": "raw", "output_mask_type": "raw", "concat_axis": -1, "mode": "concat", "output_shape": null, "output_mask": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_1", 0, 0], ["flatten_2", 0, 0], ["flatten_3", 0, 0]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 20480, "W_constraint": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "name": "dense_1", "output_dim": 512, "b_regularizer": null, "bias": true}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 512, "W_constraint": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "name": "dense_2", "output_dim": 128, "b_regularizer": null, "bias": true}, "inbound_nodes": [[["dense_1", 0, 0]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 128, "W_constraint": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "name": "dense_3", "output_dim": 16, "b_regularizer": null, "bias": true}, "inbound_nodes": [[["dense_2", 0, 0]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 16, "W_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "name": "dense_4", "output_dim": 1, "b_regularizer": null, "bias": true}, "inbound_nodes": [[["dense_3", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_4", 0, 0]]}}